package by.konoplyanik.java_online_training.module1;

// Вывести на экран соответствий между символами и их численными обозначениями в памяти компьютера

public class Problem17 {

	public static void main(String[] args) {

		char c;
		int i;
		
		c = 'h';
		i = (int) c;
		
		System.out.print("Символу " + c + " соответствует число " + i + ".");
	}

}
